resources/xmlfiles/taxlink/8065-RequisitionRequestVOD.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.vertexinc.com/vertextl/taxIntegration/types/">
	<soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
		<wsa:MessageID>uuid:59dd1ef3-143e-4721-818a-7106bbbc00d1</wsa:MessageID>
		<wsa:Action>calculation</wsa:Action>
	</soapenv:Header>
	<soapenv:Body>
		<typ:calculation>
			<typ:trxHeader>
				<typ:ApplicationId>201</typ:ApplicationId>
				<typ:ApplicationShortname>PO</typ:ApplicationShortname>
				<typ:DefaultTaxationCountry>US</typ:DefaultTaxationCountry>
				<typ:DocEventStatus>CREATED</typ:DocEventStatus>
				<typ:EntityCode>REQUISITION</typ:EntityCode>
				<typ:EventClassCode>REQUISITION</typ:EventClassCode>
				<typ:EstablishmentId>300000001140074</typ:EstablishmentId>
				<typ:EstablishmentNumber>1010</typ:EstablishmentNumber>
				<typ:EventClassMappingId>10</typ:EventClassMappingId>
				<typ:EventTypeCode>REQ_CREATED</typ:EventTypeCode>
				<typ:EndPointUrl>https://ecog-test.fa.us2.oraclecloud.com</typ:EndPointUrl>
				<typ:FirstPtyOrgId>300000004221936</typ:FirstPtyOrgId>
				<typ:HdrTrxUserKey1>CALCULATE_QUOTE</typ:HdrTrxUserKey1>
				<typ:HistoricalFlag>N</typ:HistoricalFlag>
				<typ:HqEstbPartyTaxProfId>300000001140233</typ:HqEstbPartyTaxProfId>
				<typ:InternalOrganizationId>300000005503393</typ:InternalOrganizationId>
				<typ:LedgerId>300000001139008</typ:LedgerId>
				<typ:LegalEntityId>300000001140056</typ:LegalEntityId>
				<typ:LegalEntityNumber>RIUS108111</typ:LegalEntityNumber>
				<typ:LogLevel>SEVERE</typ:LogLevel>
				<typ:ShipFromSiteRegNumber>SUPSITEREG456</typ:ShipFromSiteRegNumber>
				<typ:TrxDate>2023-07-11</typ:TrxDate>
				<typ:TrxId>929579</typ:TrxId>
				<typ:TrxLevelType>ITEM</typ:TrxLevelType>
				<typ:TrxNumber>8065</typ:TrxNumber>
			</typ:trxHeader>
			<typ:trxLineList>
				<typ:trxLine>
					<typ:AccountCcid>300000005572524</typ:AccountCcid>
					<typ:ApplicationId>201</typ:ApplicationId>
					<typ:AccountString>3211-20-60041-110-0000-0000</typ:AccountString>
					<typ:AssessableValue>200</typ:AssessableValue>
					<typ:BillFromGeographyType1>ADDRESS1</typ:BillFromGeographyType1>
					<typ:BillFromGeographyType10>PROVINCE</typ:BillFromGeographyType10>
					<typ:BillFromGeographyType2>ADDRESS2</typ:BillFromGeographyType2>
					<typ:BillFromGeographyType3>ADDRESS3</typ:BillFromGeographyType3>
					<typ:BillFromGeographyType4>ADDRESS4</typ:BillFromGeographyType4>
					<typ:BillFromGeographyType5>COUNTRY</typ:BillFromGeographyType5>
					<typ:BillFromGeographyType6>STATE</typ:BillFromGeographyType6>
					<typ:BillFromGeographyType7>COUNTY</typ:BillFromGeographyType7>
					<typ:BillFromGeographyType8>CITY</typ:BillFromGeographyType8>
					<typ:BillFromGeographyType9>POSTALCODE</typ:BillFromGeographyType9>
					<typ:BillFromGeographyValue1>411 Eagleview Bldv</typ:BillFromGeographyValue1>
					<typ:BillFromGeographyValue5>US</typ:BillFromGeographyValue5>
					<typ:BillFromGeographyValue6>Pennsylvania</typ:BillFromGeographyValue6>
					<typ:BillFromGeographyValue8>Exton</typ:BillFromGeographyValue8>
					<typ:BillFromGeographyValue9>19341</typ:BillFromGeographyValue9>
					<typ:BillFromLocationId>300000004093505</typ:BillFromLocationId>
					<typ:BillFromPartyName>MCC Test Supplier</typ:BillFromPartyName>
					<typ:BillFromPartyNumber>9002</typ:BillFromPartyNumber>
					<typ:BillToGeographyType1>ADDRESS1</typ:BillToGeographyType1>
					<typ:BillToGeographyType10>PROVINCE</typ:BillToGeographyType10>
					<typ:BillToGeographyType2>ADDRESS2</typ:BillToGeographyType2>
					<typ:BillToGeographyType3>ADDRESS3</typ:BillToGeographyType3>
					<typ:BillToGeographyType4>ADDRESS4</typ:BillToGeographyType4>
					<typ:BillToGeographyType5>COUNTRY</typ:BillToGeographyType5>
					<typ:BillToGeographyType6>STATE</typ:BillToGeographyType6>
					<typ:BillToGeographyType7>COUNTY</typ:BillToGeographyType7>
					<typ:BillToGeographyType8>CITY</typ:BillToGeographyType8>
					<typ:BillToGeographyType9>POSTALCODE</typ:BillToGeographyType9>
					<typ:BillToGeographyValue1>5430 One Shields Avenue</typ:BillToGeographyValue1>
					<typ:BillToGeographyValue5>US</typ:BillToGeographyValue5>
					<typ:BillToGeographyValue6>Pennsylvania</typ:BillToGeographyValue6>
					<typ:BillToGeographyValue8>Berwyn</typ:BillToGeographyValue8>
					<typ:BillToGeographyValue9>19312</typ:BillToGeographyValue9>
					<typ:BillToLocationId>300000001141673</typ:BillToLocationId>
					<typ:DestinationTypeCode>EXPENSE</typ:DestinationTypeCode>
					<typ:EntityCode>REQUISITION</typ:EntityCode>
					<typ:EventClassCode>REQUISITION</typ:EventClassCode>
					<typ:LineAmt>200</typ:LineAmt>
					<typ:LineAmtIncludesTaxFlag>N</typ:LineAmtIncludesTaxFlag>
					<typ:LineClass>INVOICE</typ:LineClass>
					<typ:LineLevelAction>CREATE</typ:LineLevelAction>
					<typ:LinesDetFactorId>7075324</typ:LinesDetFactorId>
					<typ:ProductOrgId>300000006755545</typ:ProductOrgId>
					<typ:ProductType>SERVICES</typ:ProductType>
					<typ:PurchaseBasis>SERVICES</typ:PurchaseBasis>
					<typ:PurchasingCategoryId>300000008643748</typ:PurchasingCategoryId>
					<typ:ShipFromGeographyType1>ADDRESS1</typ:ShipFromGeographyType1>
					<typ:ShipFromGeographyType10>PROVINCE</typ:ShipFromGeographyType10>
					<typ:ShipFromGeographyType2>ADDRESS2</typ:ShipFromGeographyType2>
					<typ:ShipFromGeographyType3>ADDRESS3</typ:ShipFromGeographyType3>
					<typ:ShipFromGeographyType4>ADDRESS4</typ:ShipFromGeographyType4>
					<typ:ShipFromGeographyType5>COUNTRY</typ:ShipFromGeographyType5>
					<typ:ShipFromGeographyType6>STATE</typ:ShipFromGeographyType6>
					<typ:ShipFromGeographyType7>COUNTY</typ:ShipFromGeographyType7>
					<typ:ShipFromGeographyType8>CITY</typ:ShipFromGeographyType8>
					<typ:ShipFromGeographyType9>POSTALCODE</typ:ShipFromGeographyType9>
					<typ:ShipFromGeographyValue1>411 Eagleview Bldv</typ:ShipFromGeographyValue1>
					<typ:ShipFromGeographyValue5>US</typ:ShipFromGeographyValue5>
					<typ:ShipFromGeographyValue6>Pennsylvania</typ:ShipFromGeographyValue6>
					<typ:ShipFromGeographyValue8>Exton</typ:ShipFromGeographyValue8>
					<typ:ShipFromGeographyValue9>19341</typ:ShipFromGeographyValue9>
					<typ:ShipFromLocationId>300000004093505</typ:ShipFromLocationId>
					<typ:ShipFromPartyName>MCC Test Supplier</typ:ShipFromPartyName>
					<typ:ShipFromPartyNumber>9002</typ:ShipFromPartyNumber>
					<typ:ShipThirdPtyAcctId>300000004093501</typ:ShipThirdPtyAcctId>
					<typ:ShipThirdPtyAcctSiteId>300000004278030</typ:ShipThirdPtyAcctSiteId>
					<typ:ShipToGeographyType1>ADDRESS1</typ:ShipToGeographyType1>
					<typ:ShipToGeographyType10>PROVINCE</typ:ShipToGeographyType10>
					<typ:ShipToGeographyType2>ADDRESS2</typ:ShipToGeographyType2>
					<typ:ShipToGeographyType3>ADDRESS3</typ:ShipToGeographyType3>
					<typ:ShipToGeographyType4>ADDRESS4</typ:ShipToGeographyType4>
					<typ:ShipToGeographyType5>COUNTRY</typ:ShipToGeographyType5>
					<typ:ShipToGeographyType6>STATE</typ:ShipToGeographyType6>
					<typ:ShipToGeographyType7>COUNTY</typ:ShipToGeographyType7>
					<typ:ShipToGeographyType8>CITY</typ:ShipToGeographyType8>
					<typ:ShipToGeographyType9>POSTALCODE</typ:ShipToGeographyType9>
					<typ:ShipToGeographyValue1>45 Florida Circle</typ:ShipToGeographyValue1>
					<typ:ShipToGeographyValue5>US</typ:ShipToGeographyValue5>
					<typ:ShipToGeographyValue6>Florida</typ:ShipToGeographyValue6>
					<typ:ShipToGeographyValue7>Miami-Dade</typ:ShipToGeographyValue7>
					<typ:ShipToGeographyValue8>Miami</typ:ShipToGeographyValue8>
					<typ:ShipToGeographyValue9>33130</typ:ShipToGeographyValue9>
					<typ:ShipToLocationId>300000006692907</typ:ShipToLocationId>
					<typ:TaxReportingFlag>N</typ:TaxReportingFlag>
					<typ:TrxBusinessCategory>PURCHASE_TRANSACTION</typ:TrxBusinessCategory>
					<typ:TrxId>929579</typ:TrxId>
					<typ:TrxLineCurrencyCode>USD</typ:TrxLineCurrencyCode>
					<typ:TrxLineDate>2023-07-11</typ:TrxLineDate>
					<typ:TrxLineId>278374</typ:TrxLineId>
					<typ:TrxLineNumber>1</typ:TrxLineNumber>
					<typ:TrxLinePrecision>2</typ:TrxLinePrecision>
					<typ:TrxLineType>ITEM</typ:TrxLineType>
					<typ:TrxLevelType>LINE</typ:TrxLevelType>
					<typ:PoNumber>8065</typ:PoNumber>
					<typ:VendorTypeLookupCode>PUBLIC SECTOR COMPANIES</typ:VendorTypeLookupCode>
					<typ:VendorNumber>10017</typ:VendorNumber>
				</typ:trxLine>
			</typ:trxLineList>
		</typ:calculation>
	</soapenv:Body>
</soapenv:Envelope>